IDEA Open Model
PolyLine2D.StartPoint Property
Compatible with IDEA StatiCa 20.1
 Gets or sets the point where the PolyLine2D begins.
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public Point2D StartPoint { get; set; }
Public Property StartPoint As Point2D
	Get
	Set
Property Value
Type: Point2D
See Also
Reference
PolyLine2D Class
IdeaRS.OpenModel.Geometry2D Namespace